[
  {
    "crop_code": "PU-31 (Pant Urd 31)",
    "cultivation_stages": [
      {
        "stage_number": 1,
        "title": "Land Preparation",
        "description": {
          "overview": "Preparing the land properly is like setting a strong foundation for your crop. It ensures good seed germination, root growth, and fewer weeds.\n• Choosing the Right Field: Pick a field with well-drained soils like black cotton, red soil, or alluvial soil. The soil should have a pH of 6–7 (slightly acidic to neutral). Avoid saline or waterlogged soils, as black gram cannot tolerate excess water. Fields previously cropped with rice, maize, or sorghum are good choices to reduce pests and diseases.\n• Clearing the Field: Remove weeds, old crop residues (like stalks or roots), and stones. You can do this manually with a hoe or use a tractor for larger fields. This prevents pests and diseases from lingering.\n• Ploughing: Plough the field 1–2 times to a depth of 15–20 cm using a tractor-drawn moldboard plough or local plough. This loosens the soil and mixes organic matter. If the soil is hard (with a hardpan), deep plough once (up to 60 cm) to help roots grow deeper.\n• Harrowing and Levelling: After ploughing, harrow the field 1–2 times with a blade harrow to break soil clods and make a fine, smooth seedbed. Level the field using a wooden plank or leveler to ensure even water distribution, especially for irrigated crops.\n• Adding Manure: Mix 5–6 tons of well-decomposed farmyard manure (penda) or compost per acre into the soil 2–3 weeks before sowing. This improves soil fertility and water-holding capacity, especially in Telangana's red soils, which are often low in nutrients.\n• Soil Testing: If possible, get your soil tested at a local Krishi Vigyan Kendra (KVK) or agricultural office to check nutrient levels and pH. For alkaline soils (pH > 7.5), apply gypsum (1–2 tons/acre) and irrigate to reduce alkalinity."
        }
      },
      {
        "stage_number": 2,
        "title": "Seed Selection and Treatment",
        "description": {
          "overview": "Choosing good seeds and treating them properly ensures healthy plants and a good crop stand. Since PU 31 is direct-seeded, nursery preparation is not needed, but the seedbed must be well-prepared.\n• Seed Selection: Buy certified PU 31 seeds from trusted sources like Professor Jay Shankar Telangana State Agricultural University (PJTSAU), KVKs, or registered seed shops in Telangana. Look for shiny, bold seeds free from damage, insects, or disease. Good seeds should have a germination rate of at least 85%.\n• Seed Treatment: Fungicide Treatment: Treat seeds with fungicides like Thiram or Carbendazim (2.5 g per kg of seed) to protect against seed-borne diseases like root rot. Mix the fungicide with seeds in a bucket or on a clean tarp. Insecticide Treatment: To control early pests like stem fly, treat seeds with Imidacloprid 600 FS (5 ml per kg seed) or Thiamethoxam 70 WS (5 g per kg seed). This protects young plants for the first few weeks. Biofertilizer Inoculation: Mix seeds with Rhizobium culture (2 g per kg seed or 400 g per acre) to help plants fix nitrogen from the air. Also, use Phosphorus Solubilizing Bacteria (PSB) at 2 kg per acre to improve phosphorus uptake. Mix biofertilizers with a little jaggery solution to make them stick to the seeds. Drying: After treatment, dry the seeds in the shade for 30–60 minutes to prevent clumping. Do not dry in direct sunlight, as it can harm the biofertilizers.\n• Seedbed Preparation (Instead of Nursery): Prepare a fine, level seedbed during land preparation (as described above). For rainfed fields in Telangana, ensure the soil has enough moisture (after the first monsoon rains). In poorly drained soils, make raised beds (10–15 cm high) to avoid waterlogging.\n• Nursery Preparation: PU-31 is sown directly in the field, so you don't need a nursery. Store seeds in a cool, dry place (like a mud pot or airtight bag) to keep them good for planting.\n• Seed Rate: Use 6–8 kg of seeds per acre (15–20 kg/ha) for PU 31. Use slightly more (8 kg/acre) for broadcasting and less (6 kg/acre) for line sowing."
        }
      },
      {
        "stage_number": 3,
        "title": "Sowing",
        "description": {
          "overview": "PU 31 is direct-seeded, not transplanted, as black gram does not respond well to transplanting. Proper sowing ensures uniform plant growth and good yields.\n• Best Time for Sowing: Kharif (Monsoon): Sow from mid-June to July, when monsoon rains start in Telangana (e.g., during Mrigasira or Ardra nakshatra for traditional farmers). This is ideal for rainfed fields. Rabi (Post-Monsoon): Sow from October to November in irrigated areas, especially in districts like Warangal, Karimnagar, or Nalgonda.\n• Sowing Method: Line Sowing: Use a seed drill or sow manually in rows, placing seeds 3–5 cm deep. Keep 30 cm between rows and 10–15 cm between plants. This gives about 1.2–1.6 lakh plants per acre, ideal for good yields. Broadcasting: In small or rainfed fields, scatter seeds evenly and cover with a light harrowing. Line sowing is better for weed control and higher yields.\n• Soil Moisture: Sow after the first monsoon rains in kharif or after pre-sowing irrigation in rabi/summer. The soil should be moist but not waterlogged."
        }
      },
      {
        "stage_number": 4,
        "title": "Fertilizer and Nutrient Management",
        "description": {
          "overview": "Giving the right nutrients at the right time helps PU 31 grow strong and produce more pods.\nA. Fertilizer Dosage and When to Apply: Nitrogen (N): 20 kg per hectare; Phosphorus (P): 40–50 kg per hectare; Potash (K): 20 kg per hectare. How to apply: Mix all these fertilizers into the soil at the time of sowing or just before sowing, at a depth of 5–7 cm. This helps the plants get nutrients easily and grow well.\nB. Organic Manure and Biofertilizers: Rhizobium Culture: Treat the seeds with Rhizobium culture (200 grams per acre) before sowing. This helps the plant get nitrogen from the air and saves 20–25% of nitrogen fertilizer. Phosphorus Solubilizing Bacteria (PSB): Mix 2 kg per acre in the soil. This makes phosphorus more available to the plants. Farmyard Manure or Vermicompost: Apply 1 ton per hectare before sowing to improve soil health and fertility.\nC. Micronutrient Management: Sulphur (S): Apply 20 kg per hectare (as gypsum or phospho-gypsum), especially in black or sandy soils. Zinc (Zn): If your soil is deficient, add 25 kg zinc sulphate per hectare.\nD. Seed Treatment: Before sowing, treat seeds with Carbendazim + Mancozeb (2 grams per kg seed) to protect from diseases. After that, treat seeds with Rhizobium culture for better root nodulation and plant health.\nE. Benefits of Improved Practices: Using improved methods (seed treatment, balanced fertilizer, organic manure, pest control) can increase PU 31 yield by 30–40% and improve your income."
        }
      },
      {
        "stage_number": 5,
        "title": "Water Management",
        "description": {
          "overview": "PU 31 needs the right amount of water—too much causes root rot, and too little reduces yields.\n• Black gram Needs Less Water: Black gram, including PU 31, does not need much water compared to other crops. It is sensitive to both too much and too little water.\n• Critical Stages for Water: The most important times to provide water are: During flowering and pod formation stages; When there is a long dry spell (no rain for many days).\n• How Much and When to Irrigate: Kharif Season (Rainy): Usually, irrigation is not needed if rainfall is normal. But, if there is no rain for several days, give one or two light irrigations, especially at flowering and pod formation. Rabi Season (Winter): Irrigate as needed to keep the soil moist but not waterlogged. Light irrigation is better than heavy watering.\n• How to Irrigate: Use light irrigation; avoid flooding the field. After each irrigation, do hoeing (light digging) to improve soil aeration and help roots grow better. Drip irrigation can save water and improve yield if available.\n• Check Soil Moisture: The soil should be moist, not dry or soggy. If the top 2–3 cm of soil feels dry to touch, it is time to irrigate.\n• Avoid Waterlogging: Black gram roots do not like standing water. Make sure excess water drains away from the field."
        }
      },
      {
        "stage_number": 6,
        "title": "Weed, Pest, and Disease Management",
        "description": {
          "overview": "Weeds, pests, and diseases can reduce your yield, so timely control is essential.\n• Weed Management: Early Stage is Critical: Weeds compete with black gram for water and nutrients, especially in the first 40 days after sowing. Controlling weeds during this period is very important for good yield. Manual Weeding: The best and simplest method is hand weeding at 20 days and again at 40 days after sowing. This method removes most weeds and helps the crop grow better. Mulching: Covering the soil with paddy straw or other plant material (mulch) can also control weeds and keep soil moisture. Use about 5 tons of paddy straw per hectare for good results. Herbicides: If available, you can use fluchloralin (trade name Basalin) at 1.5 liters per hectare before sowing and mix it well into the soil. This controls early weeds. Always follow safety instructions and local guidelines when using chemicals.\n• Pest Management: Common Pests: Main pests in PU 31 black gram are stem fly, leaf hopper, aphid, whitefly, and pod borer. Simple Control Methods: Monitoring: Check your field regularly for pest signs like yellowing leaves, holes, or sticky substances. Spraying Insecticides: Use recommended insecticides if pests appear: a) For sucking pests (leaf hopper, aphid, whitefly): Spray dimethoate or imidacloprid as per label instructions. b) For pod borer: Use profenofos or quinalphos as recommended. Remove Infested Plants: If you see plants with severe pest attack (like yellow mosaic virus), remove and destroy them to stop spread. Seed Treatment: Treat seeds with Trichoderma or Bavistin before sowing to protect young plants from root pests and diseases.\n• Disease Management: Common Diseases: Yellow mosaic virus, root rot, wilt, powdery mildew, and leaf spot. How to Manage: Yellow Mosaic Virus: Spread by whiteflies. Remove and burn infected plants quickly. Control whiteflies with insecticide spray. Root Rot/Wilt: Use disease-free seeds and treat seeds with fungicide like Bavistin (2 grams per kg of seed) or Trichoderma (4 grams per kg). Powdery Mildew & Leaf Spot: If you see white powder or brown spots on leaves, spray Bavistin solution (1 gram per liter of water) on the crop. Field Hygiene: Remove plant debris after harvest and avoid waterlogging to reduce disease risk."
        }
      },
      {
        "stage_number": 7,
        "title": "Harvesting",
        "description": {
          "overview": "Harvest PU 31 at the right time to avoid losses from pod shattering.\n• Harvest when 80–90% of pods turn black or dark brown, seeds are hard (20–22% moisture), and leaves start yellowing or drying. This is usually 80–90 days after sowing.\n• Manual Harvesting: Common in Telangana, cut plants with a sickle or pick mature pods by hand. Do this in the early morning when pods are less likely to shatter due to low humidity.\n• Multiple Pickings: PU 31 pods mature at different times, so harvest in 2–3 pickings, 5–7 days apart, to collect all mature pods.\n• Mechanical Harvesting: For large fields, use a combine harvester, adjusting it for small seeds to avoid damage. This is less common in Telangana but used in commercial farms.\n• Weather: Harvest during dry weather to prevent seed spoilage. If rain is forecast, store harvested plants in a dry shed."
        }
      },
      {
        "stage_number": 8,
        "title": "Post-Harvest Handling",
        "description": {
          "overview": "Proper handling after harvest ensures your black gram stays high-quality for selling or sowing next season.\n• Threshing: Separate seeds from pods by beating with sticks on a clean tarp or using a mechanical thresher. Be gentle to avoid cracking seeds.\n• Cleaning: Remove husks, broken seeds, and dirt by shaking the seeds gently or using a seed cleaner. This ensures clean, market-ready seeds.\n• Drying: Dry seeds under the sun for 2–3 days on a clean tarp or concrete floor until moisture is 8–10%. Stir seeds every few hours for even drying. Avoid drying on wet or muddy surfaces to prevent fungal growth.\n• Storage: Store seeds in moisture-proof gunny bags or metal drums in a cool, dry, well-ventilated shed. Add dried neem leaves (5–10 g/kg seed) or fumigants like Aluminum Phosphide (1 tablet/ton) to protect against storage pests like pulse beetles. Check bags monthly for pests or moisture.\n• Yield: With good management, PU 31 yields 5–6 quintals per acre (12–15 quintals/ha). Yields may be lower in rainfed fields or poor soils."
        }
      }
    ]
  }
] 