[
  {
    "crop_code": "WGG 42 (Yadadri)",
    "cultivation_stages": [
      {
        "stage_number": 1,
        "title": "Land Preparation",
        "description": {
          "overview": "To create a suitable environment for green gram seeds to germinate and grow.\nSoil Type: Yadadri green gram grows best in well-drained loamy or sandy-loam soils with a pH of 6.0–7.0. Avoid saline or waterlogged soils as they harm root development.\nClear the Field: Remove weeds, stones, and crop residues from previous harvests to prevent competition and pest buildup.\nPloughing: Plough the land 2–3 times using a tractor or bullock-drawn plough to a depth of 15–20 cm. This loosens the soil and improves aeration.\nHarrowing: After ploughing, use a harrow to break soil clumps and create a fine, smooth seedbed for sowing.\nLevelling: Level the field to ensure uniform water distribution during irrigation.\nAdd Organic Matter: Incorporate 5–10 tons per hectare of well-decomposed farmyard manure (FYM) or compost during the last ploughing to enrich the soil with nutrients and improve water retention.\nTiming: Prepare the land 2–3 weeks before sowing, typically during the Kharif season (June–July) or Rabi season (October–November), depending on the region and rainfall.\nProper land preparation promotes strong root growth, reduces weed competition, and ensures good seed-to-soil contact for germination."
        }
      },
      {
        "stage_number": 2,
        "title": "Seed Selection and Nursery Preparation",
        "description": {
          "overview": "Purpose: To choose high-quality seeds and prepare them for sowing to ensure healthy plants.\nSeed Selection: Variety: Use certified Yadadri (WGG 42) seeds from reliable sources like agricultural universities, Krishi Vigyan Kendras (KVKs), or registered seed companies. This variety is resistant to yellow mosaic virus and has a high yield potential of 4–5 quintals per acre.\nQuality Check: Select seeds that are uniform in size, free from damage, pests, or diseases, and not shrunken or immature. Avoid seeds mixed with debris or weed seeds.\nSeed Rate: Use 8–10 kg of seeds per acre for sowing, depending on soil fertility and sowing method.\nSeed Treatment: Treat seeds with Carbendazim or Thiram at 2 grams per kg of seed a day before sowing to protect against fungal diseases. Treat with Rhizobium culture at 25 grams per kg of seed to enhance nitrogen fixation, which improves plant growth. Apply Rhizobium after fungal treatment. Optionally, treat with Pseudomonas fluorescens (10 grams per kg of seed) or Trichoderma viride (4 grams per kg of seed) for added protection against soil-borne diseases.\nNursery Preparation (if transplanting): Green gram is usually direct-sown, but in some cases, a nursery is used for transplanting to manage water scarcity or ensure uniform growth. Nursery Bed: Prepare raised nursery beds (1 meter wide, 10–15 cm high) in a shaded area with well-drained soil. Mix FYM or compost into the soil. Sowing in Nursery: Sow treated seeds shallowly (1–2 cm deep) in rows 10 cm apart. Water lightly to keep the soil moist. Seedling Care: Maintain moisture and protect seedlings from pests. Seedlings are ready for transplanting in 3–4 weeks when they have 2–3 leaves.\nHigh-quality, treated seeds ensure better germination (above 85%) and healthy plants, while nursery preparation helps in controlled seedling growth for transplanting."
        }
      },
      {
        "stage_number": 3,
        "title": "Transplanting",
        "description": {
          "overview": "Purpose: To transfer healthy seedlings to the main field for optimal growth (if not direct-sown).\nWhen to Transplant: Transplant 3–4-week-old seedlings (with 2–3 leaves) during the early morning or evening to avoid heat stress.\nField Preparation: Ensure the main field is well-prepared, levelled, and weed-free (as described in Land Preparation). Apply basal fertilizers before transplanting (see Fertilizer Management below).\nTransplanting Process: Spacing: Maintain a spacing of 30 cm between rows and 10 cm between plants to allow adequate sunlight and air circulation. Method: Gently remove seedlings from the nursery bed with soil around the roots to avoid shock. Plant them in shallow holes in the main field at a depth of 2–3 cm. Irrigation: Irrigate immediately after transplanting to help seedlings establish roots. Keep the soil moist but not waterlogged.\nDirect Sowing (Alternative): Yadadri green gram is often directly sown using a seed drill or dibbling method. Sow seeds 2–3 cm deep in rows with the same spacing (30 cm x 10 cm). Use a tractor-drawn or bullock-drawn ferti-cum-seed drill for uniform sowing and fertilizer application.\nProper transplanting or sowing ensures uniform plant density, reduces competition, and promotes healthy growth. Direct sowing is more common for green gram due to its simplicity and cost-effectiveness."
        }
      },
      {
        "stage_number": 4,
        "title": "Fertilizer and Nutrient Management",
        "description": {
          "overview": "To provide essential nutrients for healthy plant growth and high yields.\nSoil Testing: Conduct a soil test before sowing to determine nutrient levels and pH. This helps tailor fertilizer application.\nBasal Fertilizer Application (at sowing or before transplanting): Apply 10 tons per hectare of well-decomposed FYM or compost to improve soil fertility. Use 25 kg nitrogen (N), 50 kg phosphorus (P₂O₅), 50 kg potassium (K₂O), and 20 kg sulfur (S) per hectare as basal doses. For example: Urea (46% N): 55 kg/ha for nitrogen. Single Super Phosphate (SSP) (16% P₂O₅): 310 kg/ha for phosphorus. Muriate of Potash (MOP) (60% K₂O): 85 kg/ha for potassium. Apply fertilizers using a seed drill or broadcast and incorporate into the soil during land preparation.\nSeed Treatment with Biofertilizers: As mentioned, treat seeds with Rhizobium to enhance nitrogen fixation.\nMicronutrients: Apply zinc, boron, iron, manganese, or molybdenum as foliar sprays or soil applications if deficiencies are observed (e.g., yellowing leaves indicate zinc deficiency). Example: Spray zinc sulfate (0.5%) at 20–25 days after sowing (DAS) if needed.\nTop-Dressing: Avoid excessive nitrogen top-dressing, as it can lead to excessive vegetative growth and reduced pod formation. If needed, apply 10–15 kg N/ha (e.g., 20–30 kg urea) at 20–25 DAS during flowering.\nOrganic Farming Option: Use compost, vermicompost, or green manure instead of chemical fertilizers. Apply neem cake (1 ton/ha) to provide nutrients and deter pests.\nBalanced nutrient supply promotes vigorous growth, flowering, and pod formation. Overuse of nitrogen can reduce yields, so follow recommended doses."
        }
      },
      {
        "stage_number": 5,
        "title": "Water Management",
        "description": {
          "overview": "Purpose: To provide adequate moisture for growth while avoiding water stress or waterlogging.\nWater Requirements: Green gram is a rainfed crop during the Kharif season but may need irrigation in summer or Rabi seasons. Yadadri requires 3–5 irrigations in summer, depending on soil type and climate.\nIrrigation Schedule: Pre-Sowing Irrigation: If soil is dry, irrigate the field lightly before sowing to ensure good germination. Critical Stages for Irrigation: Germination (0–10 DAS): Keep soil moist for seedling emergence. Flowering (25–35 DAS): Ensure sufficient moisture for flower formation. Pod Development (40–50 DAS): Adequate water is crucial for pod filling. Irrigate at 10–15-day intervals in summer, using 2.5–4 cm water per irrigation. Stop irrigation 55 DAS to allow pods to mature.\nMethods: Use furrow irrigation for uniform water distribution in loamy soils. Drip irrigation is ideal for water-scarce areas, delivering water directly to roots. Avoid overwatering to prevent root rot or fungal diseases.\nRainfed Conditions: In Kharif, rely on monsoon rains. If there's a dry spell, provide supplemental irrigation during critical stages.\nProper water management ensures healthy growth and prevents yield losses due to drought or waterlogging. Green gram is sensitive to excess moisture."
        }
      },
      {
        "stage_number": 6,
        "title": "Weed, Pest, and Disease Management",
        "description": {
          "overview": "To protect the crop from weeds, pests, and diseases that reduce yield and quality.\nWeed Management: Why It Matters: Weeds compete for nutrients, water, and sunlight, reducing yields by up to 50%. Manual Weeding: Perform hand weeding or hoeing at 20 DAS and 40 DAS to remove weeds. Chemical Control: Apply Pendimethalin (1 liter/acre in 100–200 liters water) within 2 days of sowing as a pre-emergence herbicide. Alternatively, use Fluchloralin (600 ml/acre) or Trifluralin (800 ml/acre) before sowing. Mulching: Use straw or plastic mulch to suppress weed growth and conserve soil moisture.\nPest Management: Common Pests: Jassids, Aphids, and Whiteflies: Suck sap, causing leaf yellowing and reduced growth. Spiny Pod Borer: Damages pods, causing 20% yield loss. Stem Fly: Attacks stems, reducing plant vigor. Control: Spray Dimethoate (250 ml/acre) or Malathion (375 ml/acre) for sucking pests like jassids and aphids. For whiteflies, use Thiamethoxam (40 gm/acre) or Triazophos (600 ml/acre). For pod borers, apply Neem-based sprays (e.g., 5% neem oil) or Spinosad (0.3 ml/liter water) at flowering. Introduce natural predators like ladybugs for aphid control in organic farming.\nDisease Management: Common Diseases: Yellow Mosaic Virus (YMV): Causes yellowing and mottling of leaves. Yadadri is resistant, but monitor for symptoms. Powdery Mildew: White powdery patches on leaves. Root Rot/Wilt: Caused by fungi, leading to plant death. Control: Remove and destroy YMV-affected plants immediately. Spray 1% Bavistin (Carbendazim) for powdery mildew or cercospora leaf spot. Drench soil with 0.1% Bavistin for root rot or wilt control. Use resistant varieties like Yadadri and maintain field hygiene.\nTimely weed, pest, and disease control prevents significant yield losses and ensures healthy pod development."
        }
      },
      {
        "stage_number": 7,
        "title": "Harvesting",
        "description": {
          "overview": "To collect mature pods at the right time to maximize yield and quality.\nWhen to Harvest: Harvest when 80–85% of pods turn yellowish-brown and dry (typically 60–75 days after sowing for Yadadri, depending on season). Check if grains are hard and have 20–22% moisture content at harvest.\nHow to Harvest: Manual Harvesting: Cut plants with a sickle or pull them by hand when pods are mature. Harvest in the morning or evening to avoid pod shattering. Mechanical Harvesting: Use a multi-crop thresher for large fields, but ensure pods are dry to prevent damage. Harvest in 2–3 pickings if pods mature unevenly, starting with fully mature pods.\nPrecautions: Avoid harvesting during high temperatures to prevent pod shattering. Irrigate the field lightly a day before harvesting to reduce pod loss.\nTimely harvesting prevents pod shattering and ensures high-quality seeds with good market value."
        }
      },
      {
        "stage_number": 8,
        "title": "Post-Harvest Handling",
        "description": {
          "overview": "To process, store, and market green gram seeds to maintain quality and profitability.\nThreshing: Dry harvested plants on a clean threshing floor for 7–10 days under the sun until pods are fully dry. Thresh by beating with sticks, using a multi-crop thresher, or trampling with a tractor to separate seeds from pods.\nCleaning: Remove chaff, dust, and broken seeds using winnowing or mechanical graders. Ensure seeds are clean and uniform for better market prices.\nDrying: Dry seeds to a moisture content of 8–10% to prevent mold growth during storage. Spread seeds thinly on a clean surface and dry under shade to avoid direct sunlight, which can reduce seed viability.\nSeed Treatment for Storage: Treat seeds with Thiram or Carbendazim (2 grams/kg) to protect against fungal infections. Mix with neem leaves or diatomaceous earth (5–10 grams/kg) for organic pest control during storage.\nStorage: Store seeds in airtight containers, jute bags, or plastic bins in a cool, dry, well-ventilated place away from sunlight and rodents. Maintain seed moisture below 10% and storage temperature below 25°C for long-term viability. Regularly inspect for pests or spoilage and take action promptly.\nMarketing: Package seeds in attractive, labeled bags to highlight the Yadadri variety's quality. Sell to local markets, wholesalers, or cooperatives. Offer promotional discounts during peak seasons to boost sales.\nProper post-harvest handling preserves seed quality, extends shelf life, and maximizes income from sales."
        }
      }
    ]
  }
] 